[
	{
		"_id" : 1, 
		"results" : "", 
		"solution" : "", 
		"process" : "", 
		"challenge" : "", 
		"description" : "", 
		"employer" : "Enlighten", 
		"image" : "Enlighten.png",
		"banner" : "Enlighten-banner.png", 
		"position" : "User Experience Strategist", 
		"contributions" : [ "Designing and wireframing web application as well as produced functional specification documents", "Supporting engineering and quality assurance team", "Conducting usability testing to validate design solutions" ]
	},
	{
		"_id" : 2, 
		"results" : "", 
		"solution" : "To support the task presented above, I chose to utilize a Parallel Coordinates visualization, a two-dimensional technique to visualize multidimensional data sets. The visualization was tied to a data table to allow a user to drill into the data in detail.\nThe parallel coordinates visualization allows a user to see the overall pattern in the data and identify outliers at a glance. Additionally, the visualization’s interactions allow the user to quickly narrow down the data presented based on a set of parameters. \n A data table at the bottom of the visualization duplicates the data represented in parallel coordinates. The purpose of the table is to show exact entries for a particular flow based on the search parameter or a filter.", 
		"process" : "I started by learning needs of the network engineers and understanding the data used to solve the problem. Once the constraints of the project became clear, I did a thorough investigation of the different types of visualization that could support the data. There were multiple options, but I focused on two: parallel coordinates and cord diagram. I tested these options by developing quick prototypes using fake data. Based on this prototyping excercise, I selected parallel coordinates. After developing and testing the visualization, it became clear that it was both difficult to set precise boundaries using only direct interactions with the visualization and difficult to judge a value of a cord for a particular axis. Based on this finding, I added a data table that allowed a user to both dynamically filter the data and drill into the specific values being visualized.", 
		"challenge" : "Network Engineers need to reduce costs by efficiently utilizing network resources. Specified task include: 1) Identify the most expensive data flows, in terms of dollars per megabit of data transferred. 2) Minimize latency by minimizing the distance from the customers’ modems to the Points of Presence (PoPs), which are the physical locations where one network provider plugs into a router of a different network.", 
		"description" : "", 
		"employer" : "DeepField Networks", 
		"eLink" : "www.deepfield.com",
		"image" : "deep-field-diagram.png", 
		"banner" : "deep-file-banner.jpg",
		"position" : "User Experience Intern", 
		"contributions" : [ "one", "two" ]
	},
	{
		"_id" : 3, 
		"results" : "Some results", 
		"solution" : "", 
		"process" : "", 
		"challenge" : "", 
		"description" : "", 
		"employer" : "TechSmith", 
		"eLink" : "www.coachseye.com",
		"image" : "TechSmith.png", 
		"banner" : "TechSmith-banner.png",
		"position" : "User Experience Intern", 
		"contributions" : [ "one", "two" ]
	},
	{
		"_id" : 4, 
		"results" : "", 
		"solution" : "", 
		"process" : "", 
		"challenge" : "", 
		"description" : "", 
		"employer" : "Global Dressage Analytics", 
		"image" : "GDA.png", 
		"banner" : "GDA-banner.png",
		"position" : "UX Designer/Web Developer", 
		"contributions" : [ "one", "two" ]
	},
	{
		"_id" : 5, 
		"results" : "", 
		"solution" : "", 
		"process" : "", 
		"challenge" : "", 
		"description" : "", 
		"employer" : "Perfect UX Process", 
		"image" : "Portfolio.png", 
		"banner" : "Portfolio-banner.png",
		"position" : "UX Developer", 
		"contributions" : [ "one", "two" ]
	},
	{
		"_id" : 6, 
		"results" : "", 
		"solution" : "", 
		"process" : "", 
		"challenge" : "", 
		"description" : "", 
		"employer" : "CERN", 
		"image" : "CMS.png", 
		"banner" : "CMS-banner.png",
		"position" : "Junior Software Engineer", 
		"contributions" : [ "one", "two" ]
	}
]